[
    {
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRLdvYiApQJofXpIjkMrJgetTXWz5wKapxKeg&s",
        "title": "Spotify",
        "companyName": "Spotify AB",
        "id": 1,
        "description": "Spotify lets you stream millions of songs, albums, and podcasts anytime, anywhere. Create your own playlists or explore curated ones made just for you. Discover new artists, follow your favorites, and enjoy personalized recommendations based on your taste. With Spotify Premium, you can listen ad-free, download tracks, and enjoy high-quality audio even offline. Whether you’re working out, traveling, or relaxing, Spotify has the perfect soundtrack for every moment. Join the global community of music lovers and start your journey through endless sound with the world’s most popular streaming app.",
        "size": "45MB",
        "reviews": "1.25M",
        "ratingAvg": 4.6,
        "downloads": "500M",
        "ratings": [
            {
                "name": "1 star",
                "count": 25000
            },
            {
                "name": "2 star",
                "count": 32000
            },
            {
                "name": "3 star",
                "count": 74000
            },
            {
                "name": "4 star",
                "count": 210000
            },
            {
                "name": "5 star",
                "count": 936000
            }
        ]
    },
    {
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS8lv-iEOWtRxGDqsOR-Pa1kIiqN298569zVA&s",
        "title": "Instagram",
        "companyName": "Meta Platforms, Inc.",
        "id": 2,
        "description": "Instagram connects you to the world through photos, videos, and Reels. Share your moments instantly, express your creativity, and stay connected with your friends, favorite creators, and global trends. Discover amazing content in Explore, message privately, or go live to engage with your audience in real time. Build your personal brand, grow your community, and discover new ideas that inspire you daily. Whether you’re posting travel photos, stories, or everyday moments, Instagram helps you express who you are. Join over a billion people sharing, discovering, and connecting on one of the most dynamic social platforms ever built.",
        "size": "40MB",
        "reviews": "2.2M",
        "ratingAvg": 4.4,
        "downloads": "1B",
        "ratings": [
            {
                "name": "1 star",
                "count": 110000
            },
            {
                "name": "2 star",
                "count": 160000
            },
            {
                "name": "3 star",
                "count": 290000
            },
            {
                "name": "4 star",
                "count": 580000
            },
            {
                "name": "5 star",
                "count": 1060000
            }
        ]
    },
    {
        "image": "https://images.seeklogo.com/logo-png/34/1/canva-logo-png_seeklogo-340767.png",
        "title": "Canva",
        "companyName": "Canva Pty Ltd",
        "id": 3,
        "description": "Canva makes graphic design simple and fun for everyone. Create eye-catching presentations, social media posts, videos, posters, and more with thousands of ready-to-use templates. Whether you’re a beginner or a pro, Canva’s drag-and-drop tools make it easy to design like a professional. Collaborate with your team in real time, add animations, and access millions of free photos, icons, and fonts. From marketing materials to personal projects, Canva helps you turn ideas into beautiful designs in minutes. Start designing today and make every creation stand out with Canva’s all-in-one creative platform.",
        "size": "35MB",
        "reviews": "780K",
        "ratingAvg": 4.7,
        "downloads": "250M",
        "ratings": [
            {
                "name": "1 star",
                "count": 10000
            },
            {
                "name": "2 star",
                "count": 15000
            },
            {
                "name": "3 star",
                "count": 42000
            },
            {
                "name": "4 star",
                "count": 160000
            },
            {
                "name": "5 star",
                "count": 553000
            }
        ]
    },
    {
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQQRvoVCco76uIoAbrclJ9JPEHlWjLxZ8Jz0g&s",
        "title": "Telegram",
        "companyName": "Telegram FZ-LLC",
        "id": 4,
        "description": "Telegram is a fast, secure, and private messaging app built for modern communication. Enjoy lightning-speed chats, cloud-based storage, and access from any device. Create massive group chats, share large files, and join public channels with millions of users. Telegram’s encrypted environment ensures your privacy while offering stickers, bots, and themes for a fun experience. Whether you’re chatting with friends or managing a community, Telegram delivers power and freedom unmatched by any other messaging platform. Discover why millions trust Telegram as their daily communication tool.",
        "size": "32MB",
        "reviews": "690K",
        "ratingAvg": 4.5,
        "downloads": "800M",
        "ratings": [
            {
                "name": "1 star",
                "count": 19000
            },
            {
                "name": "2 star",
                "count": 27000
            },
            {
                "name": "3 star",
                "count": 80000
            },
            {
                "name": "4 star",
                "count": 190000
            },
            {
                "name": "5 star",
                "count": 374000
            }
        ]
    },
    {
        "image": "https://images.seeklogo.com/logo-png/45/1/duolingo-logo-png_seeklogo-458347.png",
        "title": "Duolingo",
        "companyName": "Duolingo, Inc.",
        "id": 5,
        "description": "Duolingo makes language learning fun, free, and effective. Learn over 30 languages including Spanish, French, German, and Japanese through bite-sized lessons designed like games. Practice speaking, reading, and listening every day with personalized exercises that adapt to your level. Stay motivated with streaks, rewards, and challenges. Whether you’re learning for school, travel, or self-improvement, Duolingo helps you reach your goals with engaging content and smart learning techniques. Join millions of learners worldwide and make language learning an enjoyable daily habit.",
        "size": "25MB",
        "reviews": "540K",
        "ratingAvg": 4.8,
        "downloads": "350M",
        "ratings": [
            {
                "name": "1 star",
                "count": 6000
            },
            {
                "name": "2 star",
                "count": 9000
            },
            {
                "name": "3 star",
                "count": 24000
            },
            {
                "name": "4 star",
                "count": 105000
            },
            {
                "name": "5 star",
                "count": 396000
            }
        ]
    },
    {
        "image": "https://static.vecteezy.com/system/resources/previews/017/396/804/non_2x/netflix-mobile-application-logo-free-png.png",
        "title": "Netflix",
        "companyName": "Netflix, Inc.",
        "id": 6,
        "description": "Netflix is your gateway to endless entertainment. Stream a massive library of movies, TV shows, and exclusive Netflix Originals anytime, anywhere. Enjoy high-definition video, create personal watchlists, and get tailored recommendations based on your viewing habits. Whether you love thrillers, comedies, documentaries, or children’s shows, Netflix offers something for everyone. Watch offline by downloading your favorite titles, and explore new releases daily. With Netflix, you control how, when, and what you watch, making entertainment flexible, fun, and personal. Join millions of subscribers worldwide and experience the ultimate streaming platform.",
        "size": "80MB",
        "reviews": "2.3M",
        "ratingAvg": 4.3,
        "downloads": "1B",
        "ratings": [
            {
                "name": "1 star",
                "count": 190000
            },
            {
                "name": "2 star",
                "count": 220000
            },
            {
                "name": "3 star",
                "count": 330000
            },
            {
                "name": "4 star",
                "count": 600000
            },
            {
                "name": "5 star",
                "count": 960000
            }
        ]
    },
    {
        "image": "https://static.vecteezy.com/system/resources/previews/017/396/810/non_2x/snapseed-by-google-free-png.png",
        "title": "Snapseed",
        "companyName": "Google LLC",
        "id": 7,
        "description": "Snapseed is a professional photo editing app developed by Google. Use 29 powerful editing tools and filters to enhance your photos with precision. Adjust colors, crop, straighten, and correct perspective with ease. Add artistic effects, create unique looks, and fine-tune every detail to make your images shine. Whether you’re a casual photographer or a pro, Snapseed gives you complete control over your photos. Share your creations directly to social media or save them in high resolution. Transform ordinary photos into stunning masterpieces with Snapseed’s intuitive and feature-rich platform.",
        "size": "27MB",
        "reviews": "410K",
        "ratingAvg": 4.7,
        "downloads": "200M",
        "ratings": [
            {
                "name": "1 star",
                "count": 7000
            },
            {
                "name": "2 star",
                "count": 10000
            },
            {
                "name": "3 star",
                "count": 25000
            },
            {
                "name": "4 star",
                "count": 82000
            },
            {
                "name": "5 star",
                "count": 286000
            }
        ]
    },
    {
        "image": "https://static.vecteezy.com/system/resources/previews/042/148/616/non_2x/pinterest-logo-pinterest-social-media-icon-free-png.png",
        "title": "Pinterest",
        "companyName": "Pinterest, Inc.",
        "id": 8,
        "description": "Pinterest helps you discover and save creative ideas for cooking, fashion, home decor, travel, and more. Explore a world of inspiration and organize your favorite ideas on boards for easy access. Whether you’re planning a party, redecorating a room, or looking for DIY projects, Pinterest offers endless possibilities. Connect with a community of creators, follow trends, and find ideas that match your style. With personalized recommendations, smart search, and visual discovery, Pinterest turns your imagination into reality. Save, share, and explore creativity like never before with Pinterest at your fingertips.",
        "size": "38MB",
        "reviews": "870K",
        "ratingAvg": 4.6,
        "downloads": "500M",
        "ratings": [
            {
                "name": "1 star",
                "count": 18000
            },
            {
                "name": "2 star",
                "count": 25000
            },
            {
                "name": "3 star",
                "count": 59000
            },
            {
                "name": "4 star",
                "count": 210000
            },
            {
                "name": "5 star",
                "count": 558000
            }
        ]
    },
    {
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTP_2ocy-aXMnWKWhBXTmHfLAy7xWR3WF2OJw&s",
        "title": "YouTube",
        "companyName": "Google LLC",
        "id": 9,
        "description": "YouTube is the world’s leading video-sharing platform where you can watch, upload, and share videos on any topic imaginable. Explore tutorials, music videos, vlogs, documentaries, and trending content from creators worldwide. Subscribe to channels, create playlists, and enjoy personalized recommendations tailored to your interests. Engage with the community through comments, likes, and shares. With YouTube Premium, enjoy ad-free viewing, offline downloads, and background play. Whether you’re learning, entertaining, or creating, YouTube empowers everyone to share their story and discover new experiences on a global scale.",
        "size": "75MB",
        "reviews": "6.5M",
        "ratingAvg": 4.5,
        "downloads": "10B+",
        "ratings": [
            {
                "name": "1 star",
                "count": 350000
            },
            {
                "name": "2 star",
                "count": 400000
            },
            {
                "name": "3 star",
                "count": 600000
            },
            {
                "name": "4 star",
                "count": 1500000
            },
            {
                "name": "5 star",
                "count": 3650000
            }
        ]
    },
    {
        "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6b/WhatsApp.svg/2044px-WhatsApp.svg.png",
        "title": "WhatsApp Messenger",
        "companyName": "WhatsApp Inc.",
        "id": 10,
        "description": "WhatsApp Messenger offers fast, simple, and secure messaging and calling for free worldwide. Chat with friends, family, and colleagues instantly with text, voice, and video messages. Share photos, documents, and location with ease. End-to-end encryption ensures your conversations stay private. Create groups to stay connected with multiple contacts, broadcast important updates, or coordinate projects. WhatsApp works across devices seamlessly and allows you to communicate globally without extra charges. Stay connected with the people who matter most, wherever you are, using WhatsApp’s reliable and intuitive platform.",
        "size": "38MB",
        "reviews": "4.5M",
        "ratingAvg": 4.5,
        "downloads": "5B+",
        "ratings": [
            {
                "name": "1 star",
                "count": 200000
            },
            {
                "name": "2 star",
                "count": 250000
            },
            {
                "name": "3 star",
                "count": 420000
            },
            {
                "name": "4 star",
                "count": 1000000
            },
            {
                "name": "5 star",
                "count": 2630000
            }
        ]
    },
    {
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQuB79MjNSFlE0-cyrc_pjYnXv7PcnM4EGXSw&s",
        "title": "Zoom",
        "companyName": "Zoom Video Communications",
        "id": 11,
        "description": "Zoom makes video conferencing, meetings, and team collaboration simple and effective. Host HD video meetings with screen sharing, chat, and virtual backgrounds. Schedule and join meetings from any device and collaborate with team members in real time. Zoom is ideal for work, school, webinars, or staying in touch with friends and family. Record sessions, organize meetings, and manage participants with ease. With security features and easy-to-use tools, Zoom ensures reliable communication for personal and professional needs. Join millions worldwide using Zoom to connect, collaborate, and communicate seamlessly.",
        "size": "55MB",
        "reviews": "870K",
        "ratingAvg": 4.6,
        "downloads": "500M",
        "ratings": [
            {
                "name": "1 star",
                "count": 22000
            },
            {
                "name": "2 star",
                "count": 30000
            },
            {
                "name": "3 star",
                "count": 50000
            },
            {
                "name": "4 star",
                "count": 210000
            },
            {
                "name": "5 star",
                "count": 560000
            }
        ]
    },
    {
        "image": "https://images.seeklogo.com/logo-png/49/2/twitter-x-logo-png_seeklogo-492396.png",
        "title": "X (Twitter)",
        "companyName": "X Corp.",
        "id": 12,
        "description": "X (Twitter) is a social media platform where you can follow the latest news, trends, and updates in real time. Share short posts, engage with your followers, and connect with people around the world. Discover trending topics, join conversations, and follow creators that inspire you. Whether you’re sharing thoughts, reading news, or building a personal brand, X keeps you informed and engaged. Participate in global discussions, retweet content, and enjoy a dynamic platform that brings communities together. Stay up-to-date, connected, and heard with X.",
        "size": "58MB",
        "reviews": "2.4M",
        "ratingAvg": 4.1,
        "downloads": "1B+",
        "ratings": [
            {
                "name": "1 star",
                "count": 150000
            },
            {
                "name": "2 star",
                "count": 190000
            },
            {
                "name": "3 star",
                "count": 250000
            },
            {
                "name": "4 star",
                "count": 700000
            },
            {
                "name": "5 star",
                "count": 1110000
            }
        ]
    },
    {
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRkPKagl5Az3J8XgqnSneFgKceE0HDuK6nnog&s",
        "title": "LinkedIn",
        "companyName": "LinkedIn Corporation",
        "id": 13,
        "description": "LinkedIn helps professionals connect, find jobs, and grow their careers. Create a profile showcasing your experience, skills, and achievements. Network with colleagues, recruiters, and industry experts worldwide. Join groups, follow companies, and discover opportunities for career advancement. Share updates, articles, and insights to build your professional brand. LinkedIn provides tools for learning, skill development, and staying informed about industry trends. Whether you’re job hunting, recruiting, or expanding your network, LinkedIn is the essential platform for professional growth and connection.",
        "size": "60MB",
        "reviews": "1.1M",
        "ratingAvg": 4.4,
        "downloads": "1B+",
        "ratings": [
            {
                "name": "1 star",
                "count": 50000
            },
            {
                "name": "2 star",
                "count": 60000
            },
            {
                "name": "3 star",
                "count": 120000
            },
            {
                "name": "4 star",
                "count": 300000
            },
            {
                "name": "5 star",
                "count": 640000
            }
        ]
    },
    {
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRwV7aB2HJUXm9ny3SAvwLWnpw67-z3BPImvA&s",
        "title": "Amazon Shopping",
        "companyName": "Amazon Mobile LLC",
        "id": 14,
        "description": "Amazon Shopping makes it easy to shop online for millions of products across categories. Discover deals, read reviews, compare prices, and get fast delivery to your doorstep. Access a personalized experience with wishlists, recommendations, and exclusive offers. Manage orders, track shipments, and enjoy convenient returns. Whether you’re buying electronics, clothing, groceries, or more, Amazon ensures a seamless and secure shopping experience. Shop from anywhere at any time and enjoy the convenience of one of the world’s largest online marketplaces at your fingertips.",
        "size": "72MB",
        "reviews": "5.5M",
        "ratingAvg": 4.5,
        "downloads": "1B+",
        "ratings": [
            {
                "name": "1 star",
                "count": 300000
            },
            {
                "name": "2 star",
                "count": 350000
            },
            {
                "name": "3 star",
                "count": 500000
            },
            {
                "name": "4 star",
                "count": 1200000
            },
            {
                "name": "5 star",
                "count": 3150000
            }
        ]
    },
    {
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSf3Y9wtDBk52VMs-_K6EVUDn8GKooJriOMNw&s",
        "title": "Adobe Photoshop Express",
        "companyName": "Adobe Inc.",
        "id": 15,
        "description": "Adobe Photoshop Express brings powerful photo editing to your fingertips. Enhance images, apply filters, adjust colors, crop, rotate, and remove blemishes easily. Create stunning visuals for social media, presentations, or personal projects. Access creative tools like text overlays, frames, and effects to transform ordinary photos into extraordinary artwork. With Adobe’s intuitive interface, beginners and professionals alike can edit images with precision. Share your creations instantly or save them in high resolution. Photoshop Express combines creativity, speed, and power in a mobile photo editing app that inspires every user.",
        "size": "82MB",
        "reviews": "1.2M",
        "ratingAvg": 4.6,
        "downloads": "100M",
        "ratings": [
            {
                "name": "1 star",
                "count": 25000
            },
            {
                "name": "2 star",
                "count": 35000
            },
            {
                "name": "3 star",
                "count": 60000
            },
            {
                "name": "4 star",
                "count": 250000
            },
            {
                "name": "5 star",
                "count": 880000
            }
        ]
    },
    {
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTiAibtuIe2BI9kfJQE2nBDrdkgyBSrASSPWw&s",
        "title": "Uber",
        "companyName": "Uber Technologies Inc.",
        "id": 16,
        "description": "Uber makes getting around your city easier, safer, and faster. Book rides instantly, share trips with friends, and track your driver in real time. Explore various ride options from budget-friendly to premium services. Pay securely within the app and receive receipts automatically. Uber also offers food delivery through Uber Eats, providing convenience at your doorstep. With reliable drivers, transparent pricing, and innovative features, Uber transforms everyday transportation into a seamless experience. Whether commuting, traveling, or going out, Uber helps millions move with comfort, efficiency, and peace of mind.",
        "size": "65MB",
        "reviews": "3.1M",
        "ratingAvg": 4.2,
        "downloads": "1B+",
        "ratings": [
            {
                "name": "1 star",
                "count": 200000
            },
            {
                "name": "2 star",
                "count": 250000
            },
            {
                "name": "3 star",
                "count": 350000
            },
            {
                "name": "4 star",
                "count": 800000
            },
            {
                "name": "5 star",
                "count": 1500000
            }
        ]
    }
]